#+BEGIN_EXPORT html
---
layout: post
title: A cramped elephant
tagline: " at the first glance"
permalink: /postgres/first-steps.html
categories: [Postgres, Debian9, literate programming]
tags: [post-installation, configuration]
---
#+END_EXPORT

#+STARTUP: showall
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 2
#+PROPERTY:header-args :results output :exports both :eval no-export

** Table creation
   
   #+BEGIN_SRC sql :engine postgresql
     CREATE TABLE weather (
	 city            varchar(80),
	 temp_lo         int,           -- low temperature
	 temp_hi         int,           -- high temperature
	 prcp            real,          -- precipitation
	 date            date
     );

     CREATE TABLE cities (
	 name            varchar(80),
	 location        point
     );
   #+END_SRC

   #+RESULTS:
   : CREATE TABLE
   : CREATE TABLE

** Check existing tables

   #+BEGIN_SRC sql :engine postgresql
   \d
   #+END_SRC

   #+RESULTS:
   : List of relations
   : Schema	Name	Type	Owner
   : public	cities	table	alioth
   : public	weather	table	alioth

** Populating tables with data

   #+BEGIN_SRC sql :engine postgresql
   -- Direct and blind approach
   INSERT INTO weather VALUES
   ('San Francisco', 46, 50, 0.25, '1994-11-27');
   INSERT INTO cities VALUES ('San Francisco', '(-194.0, 53.0)');
   -- Direct and straightforward method
   INSERT INTO weather (city, temp_lo, temp_hi, prcp, date)
    VALUES ('San Francisco', 43, 57, 0.0, '1994-11-29');
    INSERT INTO weather (date, city, temp_hi, temp_lo)
    VALUES ('1994-11-29', 'Hayward', 54, 37);
   #+END_SRC

   #+RESULTS:
   : INSERT 0 1
   : INSERT 0 1
   : INSERT 0 1
   : INSERT 0 1

** Retrieving data
   
   #+BEGIN_SRC sql :engine postgresql :results output
   SELECT city, temp_lo, temp_hi, prcp, date FROM weather;
   #+END_SRC

   #+RESULTS:
   : city	temp_lo	temp_hi	prcp	date
   : San Francisco	46	50	0.25	1994-11-27
   : San Francisco	43	57	0	1994-11-29
   : Hayward	37	54		1994-11-29

** Tables deletion

   #+BEGIN_SRC sql :engine postgresql
     DROP TABLE weather;
     DROP TABLE cities;
   #+END_SRC

   #+RESULTS:
   : DROP TABLE
   : DROP TABLE

** Check existing tables

   #+BEGIN_SRC sql :engine postgresql
   \d
   #+END_SRC

   #+RESULTS:
   : No relations found.
